{"keras_version": "2.2.2", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 3], "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "trainable": true, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "trainable": true, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "trainable": true, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "trainable": true, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "trainable": true, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "trainable": true, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Reshape", "config": {"trainable": true, "target_shape": [-1, 128], "name": "reshape_1"}, "name": "reshape_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Capsule", "config": {"trainable": true, "name": "capsule_1"}, "name": "capsule_1"}, {"inbound_nodes": [[["capsule_1", 0, 0, {}]]], "class_name": "Lambda", "config": {"function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcyIAAAB0AABqAQB0AABqAgB0AABqAwB8AACDAQBkAQCDAgCD\nAQBTKQJO6QIAAAApBNoBS9oEc3FydNoDc3Vt2gZzcXVhcmUpAdoBeKkAcgcAAAD6Ey4vc3JjL2Nh\ncHN1bGVuZXQucHnaCDxsYW1iZGE+kgAAAHMAAAAA\n", null, null], "output_shape": [3], "function_type": "lambda", "arguments": {}, "name": "lambda_1", "trainable": true, "output_shape_type": "raw"}, "name": "lambda_1"}], "output_layers": [["lambda_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}